import React, { useState } from "react";

export default function Survey(){
  function set_1(){
    
  }
  function set_2(){
    
  }
  function set_3(){
    
  }
  function set_4(){
    
  }
  function set_5(){
    
  }
  function set_6(){
    
  }
  function set_7(){
    
  }
  function set_8(){
    
  }
  function set_9(){
    
  }
  const [survey, setSurvey] = useState({
    "목적 및 용도_0": [0],
    "목적 및 용도_1": [0],
    "목적 및 용도_2": [0],
    "목적 및 용도_3": [0],
    "목적 및 용도_4": [0],
    "목적 및 용도_5": [0],
    "목적 및 용도_6": [0],
    "목적 및 용도_7": [0],
    "목적 및 용도_8": [0],
    "목적 및 용도_9": [0],
    "목적 및 용도_10": [0],
    "목적 및 용도_11": [0],
    "목적 및 용도_12": [0],
    "목적 및 용도_13": [0],
    "목적 및 용도_14": [0],
    "목적 및 용도_15": [0],
    "목적 및 용도_16": [0],
    "목적 및 용도_17": [0],
    "성능의 중요성": [0],
    "데이터 저장": [0],
    "일 평균 사용량 추측": [0],
    "일 평균 사용시간 추측": [0],
    "사용시간 대 추측": [0],
    "사용기간 추측": [0],
    "기술 지원": [0],
    "미래 성장": [0]
  
  });

}

